brew "act"
brew "actionlint"
brew "mise"
brew "bash-completion"
brew "bat"
brew "broot"
brew "curl"
brew "deno"
brew "diffutils"
brew "direnv"
brew "elinks"
brew "fasd"
brew "fd"
brew "findutils"
brew "git"
brew "git-delta"
brew "gitmux"
brew "gnu-getopt"
brew "gnu-sed"
brew "grep"
brew "hub"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lua-language-server"
brew "mackup"
brew "moreutils"
brew "neovim"
brew "ripgrep"
brew "sed"
brew "shellcheck"
brew "shellfmt"
brew "terragrunt"
brew "tflint"
brew "tig"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "vifm"

# CLI speed test
tap "teamookla/speedtest"
brew "speedtest"

# logitech drivers for mouse/keyboard
tap "homebrew/cask-drivers"
cask "homebrew/cask-drivers/logitech-options"

# PHP for Alfred github plugin
brew "argon2"
brew "aspell"
brew "freetds"
brew "gd"
brew "icu4c"
brew "libsodium"
brew "libzip"
brew "tidy-html5"
brew "php", args: ["ignore-dependencies"]
# END PHP

cask "authy"
cask "datagrip"
cask "dash"
cask "wezterm"
cask "karabiner-elements"

# personal apps
cask "marta"
cask "dropbox"
cask "vlc"
cask "nvalt"
cask "caffeine"
cask "telegram"
cask "signal"
cask "calibre"
cask "kindle"
cask "send-to-kindle"
cask "notion"
cask "google-drive"
cask "shottr"

# paid apps
cask "bartender"
cask "daisydisk"
cask "istat-menus"
cask "alfred"
cask "bitwarden"

brew "tmuxinator-completion"

tap "homebrew/cask-fonts"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-anonymice-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-meslo-for-powerline"
cask "font-ubuntu-mono-derivative-powerline"
cask "font-meslo-lg-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-victor-mono-nerd-font"

brew "mas" # required for using mas in a brewfile
mas "HyperDock",              id: 449830122
mas "Paprika Recipe Manager", id: 1303222628
